TCWORLD/ATTinyCore/tiny/boards.txt
attiny85at1.bootloader.tool=arduino:avrdude
attiny85at1.bootloader.low_fuses=0x62
attiny85at1.bootloader.high_fuses=0xD7
attiny85at1.bootloader.extended_fuses=0xFF
#attiny85at1.bootloader.path=empty
attiny85at1.bootloader.file=empty/empty85at1.hex

attiny85at1.build.mcu=attiny85
attiny85at1.build.f_cpu=1000000L
attiny85at1.build.core=tiny
attiny85at1.build.variant=tinyX5
attiny85at1.build.board=ATTINY85
 
###########################################################################

attiny85at128.name=ATtiny85 @ 128 KHz  (watchdog oscillator; 1.8 V BOD)
attiny85at128.upload.tool=arduino:avrdude
attiny85at128.upload.maximum_size=8192

# WD. Osc. 128 kHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 0 ms; [CKSEL=0100 SUT=00]
# Brown-out detection level at VCC=1.8 V; [BODLEVEL=110]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]

attiny85at128.bootloader.tool=arduino:avrdude
attiny85at128.bootloader.low_fuses=0xC4
attiny85at128.bootloader.high_fuses=0xD6
attiny85at128.bootloader.extended_fuses=0xFF
#attiny85at128.bootloader.path=empty
attiny85at128.bootloader.file=empty/empty85at1.hex

attiny85at128.build.mcu=attiny85
attiny85at128.build.f_cpu=128000L
attiny85at128.build.core=tiny
attiny85at128.build.variant=tinyX5
attiny85at128.build.board=ATTINY85
 
###########################################################################
############################  A T T I N Y 2 3 1 3  ########################
###########################################################################

attiny2313at8.name=ATtiny2313 @ 8 MHz
attiny2313at8.upload.tool=arduino:avrdude
attiny2313at8.upload.maximum_size=2048

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

attiny2313at8.bootloader.tool=arduino:avrdude
attiny2313at8.bootloader.low_fuses=0xE4
attiny2313at8.bootloader.high_fuses=0x9F
attiny2313at8.bootloader.extended_fuses=0xFF
#attiny2313at8.bootloader.path=empty
attiny2313at8.bootloader.file=empty/empty2313at8.hex

attiny2313at8.build.mcu=attiny2313
attiny2313at8.build.f_cpu=8000000L
attiny2313at8.build.core=tiny
attiny2313at8.build.variant=tinyX313
attiny2313at8.build.board=ATTINY2313
 
###########################################################################

attiny2313at1.name=ATtiny2313 @ 1 MHz
attiny2313at1.upload.tool=arduino:avrdude
attiny2313at1.upload.maximum_size=2048

# Default clock (slowly rising power; long delay to clock; 8 MHz internal; divide clock by 8)
# Int. RC Osc. 8 MHz; Start-up time: 14 CK + 65 ms; [CKSEL=0100 SUT=10]; default value 
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]

attiny2313at1.bootloader.tool=arduino:avrdude
attiny2313at1.bootloader.low_fuses=0x64
attiny2313at1.bootloader.high_fuses=0x9F
attiny2313at1.bootloader.extended_fuses=0xFF
#attiny2313at1.bootloader.path=empty
attiny2313at1.bootloader.file=empty/empty2313at1.hex

attiny2313at1.build.mcu=attiny2313
attiny2313at1.build.f_cpu=1000000L
attiny2313at1.build.core=tiny
attiny2313at1.build.variant=tinyX313
attiny2313at1.build.board=ATTINY2313


###########################################################################
############################  A T T I N Y 8 6 1  ##########################
###########################################################################

attiny861at1.name=ATtiny861 @ 1 MHz  (internal oscillator; BOD disabled)
attiny861at1.upload.tool=arduino:avrdude
attiny861at1.upload.maximum_size=8192

# Default clock (slowly rising power; long delay to clock; 1 MHz internal)
# Int. RC Osc. 8 MHz divided by 8; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]

attiny861at1.bootloader.tool=arduino:avrdude
attiny861at1.bootloader.low_fuses=0x62
attiny861at1.bootloader.high_fuses=0xDF
attiny861at1.bootloader.extended_fuses=0xFF
#attiny861at1.bootloader.path=empty
attiny861at1.bootloader.file=empty/empty861at8.hex

attiny861at1.build.mcu=attiny861
attiny861at1.build.f_cpu=1000000L
attiny861at1.build.core=tiny
attiny861at1.build.variant=tinyX61
attiny861at1.build.board=ATTINY861
 

###########################################################################
############################  A T T I N Y 1 6 7  ##########################
###########################################################################


attiny167.name=ATtiny167 @ 8 MHz  (internal oscillator; BOD enabled)
attiny167.upload.tool=arduino:avrdude
attiny167.upload.maximum_size=16384

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value

# Brown-out detection disabled; [BODLEVEL=111]

# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Self-Programming Disabled; [SELFPRGEN=1]

attiny167.bootloader.tool=arduino:avrdude
attiny167.bootloader.low_fuses=0xE2
attiny167.bootloader.high_fuses=0xD7
attiny167.bootloader.extended_fuses=0xFF
#attiny167.bootloader.path=empty
attiny167.bootloader.file=empty/empty167.hex


attiny167.build.mcu=attiny167
attiny167.build.f_cpu=8000000L
attiny167.build.core=tiny
attiny167.build.variant=tinyX7
attiny167.build.board=ATTINY167
 
 
 
###########################################################################
###########################  A T T I N Y 8 8  #############################
###########################################################################

attiny88_8.name=ATtiny88 @ 8 MHz  (internal oscillator; BOD disabled)
attiny88_8.upload.tool=arduino:avrdude
attiny88_8.upload.maximum_size=8192

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Self-Programming Disabled; [SELFPRGEN=1]

attiny88_8.bootloader.extended_fuses=0x07
attiny88_8.bootloader.low_fuses=0xEE
attiny88_8.bootloader.high_fuses=0xD7

