TCWORLD/ATTinyCore/tiny/boards.txt
attiny88_8.bootloader.tool=arduino:avrdude
#attiny88_8.bootloader.path=empty
attiny88_8.bootloader.file=empty/empty88at8.hex
attiny88_8.build.mcu=attiny88
attiny88_8.build.f_cpu=8000000L
attiny88_8.build.core=tiny
attiny88_8.build.variant=tinyX8
attiny88_8.build.board=ATTINY88


###########################################################################
 
attiny88_1.name=ATtiny88 @ 1 MHz  (internal oscillator; BOD disabled)
attiny88_1.upload.tool=arduino:avrdude
attiny88_1.upload.maximum_size=8192

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms; [CKSEL=1110 SUT=10]; default value
# Divide clock by 8 internally; [CKDIV8=0]
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Serial program downloading (SPI) enabled; [SPIEN=0]
# Self-Programming Disabled; [SELFPRGEN=1]

attiny88_1.bootloader.high_fuses=0xD7
attiny88_1.bootloader.low_fuses=0x6E
attiny88_1.bootloader.extended_fuses=0x07

attiny88_1.bootloader.tool=arduino:avrdude
#attiny88_1.bootloader.path=empty
attiny88_1.bootloader.file=empty/empty88at1.hex
attiny88_1.build.mcu=attiny88
attiny88_1.build.f_cpu=1000000L
attiny88_1.build.core=tiny
attiny88_1.build.variant=tinyX8
attiny88_1.build.board=ATTINY88

###########################################################################
###########################  O P T I B O O T  ############################# 
###########################################################################

attiny167_20.name=Optiboot ATtiny167 @ 20 MHz  (external oscillator; BOD enabled)

attiny167_20.upload.tool=arduino:avrdude
attiny167_20.upload.speed=57600
attiny167_20.upload.maximum_size=15808

# Default clock (slowly rising power; long delay to clock; 8 MHz internal)
# Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 64 ms; [CKSEL=0010 SUT=10]; default value
# Brown-out detection disabled; [BODLEVEL=111]
# Preserve EEPROM memory through the Chip Erase cycle; [EESAVE=0]
# Self-Programming Enabled; [SELFPRGEN=0]

attiny167_20.bootloader.tool=arduino:avrdude
attiny167_20.bootloader.low_fuses=0xA0
attiny167_20.bootloader.high_fuses=0xDF
attiny167_20.bootloader.extended_fuses=0xFE
attiny167_20.bootloader.file=optiboot/optiboot_attiny167.hex

attiny167_20.build.mcu=attiny167
attiny167_20.build.f_cpu=20000000L
attiny167_20.build.core=tiny
attiny167_20.build.variant=tinyX7 
attiny167_20.build.board=ATTINY167


 
###########################################################################

attiny84_12.name=Optiboot ATtiny84 @ 12 MHz  (external osc)

attiny84_12.upload.tool=arduino:avrdude
attiny84_12.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny84_12.upload.maximum_size=7616

attiny84_12.bootloader.tool=arduino:avrdude
attiny84_12.bootloader.low_fuses=0xE0
attiny84_12.bootloader.high_fuses=0xD7
attiny84_12.bootloader.extended_fuses=0xFE
#attiny84_12.bootloader.path=optiboot
attiny84_12.bootloader.file=optiboot/optiboot_attiny84_12.hex

attiny84_12.build.mcu=attiny84
attiny84_12.build.f_cpu=12000000L
attiny84_12.build.core=tiny
attiny84_12.build.variant=tinyX4optiboot
attiny84_12.build.board=ATTINY84

 
###########################################################################

attiny84_12_no.name=Optiboot ATtiny84 @ 12 MHz  (external osc - NO MILLIS!)

attiny84_12_no.upload.tool=arduino:avrdude
attiny84_12_no.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny84_12_no.upload.maximum_size=7616

attiny84_12_no.bootloader.tool=arduino:avrdude
attiny84_12_no.bootloader.low_fuses=0xE0
attiny84_12_no.bootloader.high_fuses=0xD7
attiny84_12_no.bootloader.extended_fuses=0xFE
#attiny84_12_no.bootloader.path=optiboot
attiny84_12_no.bootloader.file=optiboot/optiboot_attiny84_12.hex

attiny84_12_no.build.mcu=attiny84
attiny84_12_no.build.f_cpu=12000000L
attiny84_12_no.build.core=tinyNoMillis
attiny84_12_no.build.variant=tinyX4optiboot
attiny84_12_no.build.board=ATTINY84


###########################################################################
attiny84.name=Optiboot ATtiny84 @ 8 MHz  (internal osc)

attiny84.upload.tool=arduino:avrdude
attiny84.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny84.upload.maximum_size=7616

attiny84.bootloader.tool=arduino:avrdude
attiny84.bootloader.low_fuses=0xE2
attiny84.bootloader.high_fuses=0xD7
attiny84.bootloader.extended_fuses=0xFE
#attiny84.bootloader.path=optiboot
attiny84.bootloader.file=optiboot/optiboot_attiny84.hex

attiny84.build.mcu=attiny84
attiny84.build.f_cpu=8000000L
attiny84.build.core=tiny
attiny84.build.variant=tinyX4optiboot
attiny84.build.board=ATTINY84
 
###########################################################################

attiny84nr.name=Optiboot ATtiny84 @ 8 MHz  (NO RESET!)

attiny84nr.upload.tool=arduino:avrdude
attiny84nr.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny84nr.upload.maximum_size=7616

attiny84nr.bootloader.tool=arduino:avrdude
attiny84nr.bootloader.low_fuses=0xE2
attiny84nr.bootloader.high_fuses=0x57
attiny84nr.bootloader.extended_fuses=0xFE
#attiny84nr.bootloader.path=optiboot
attiny84nr.bootloader.file=optiboot/optiboot_attiny84.hex

attiny84nr.build.mcu=attiny84
attiny84nr.build.f_cpu=8000000L
attiny84nr.build.core=tiny
attiny84nr.build.variant=tinyX4optiboot
attiny84nr.build.board=ATTINY84
 
###########################################################################

attiny85.name=Optiboot ATtiny85 @ 8 MHz  (internal osc)

attiny85.upload.tool=arduino:avrdude
attiny85.upload.speed=19200
#bootloader takes up last 9 pages, so there is a limit on the max size.
attiny85.upload.maximum_size=7616

attiny85.bootloader.tool=arduino:avrdude
attiny85.bootloader.low_fuses=0xE2
attiny85.bootloader.high_fuses=0xD7
attiny85.bootloader.extended_fuses=0xFE
#attiny85.bootloader.path=optiboot
attiny85.bootloader.file=optiboot/optiboot_attiny85.hex

attiny85.build.mcu=attiny85
attiny85.build.f_cpu=8000000L
attiny85.build.core=tiny
attiny85.build.variant=tinyX5optiboot
attiny85.build.board=ATTINY85
 
###